// function namesurname() {
//     console.log("ilia dzindzibadze");
//     let name = "ilia";
//     let surname = "dzindzibadze"
//     console.log(name + " " + surname)
// }

// namesurname();


function butt() {
    console.log("why you click button?");
}

// ჯავასკრიპტში ფუნქციების გაკეთების დროს ჯერ უნდა დავწეროთ function იმისთვირს რომ კომპიუტერს მივანიშნოთ ის რომ ეხლა ფუნქციას დავწეროთ
// ამის შემდეგ უნდა დავწეროთ ფუნქციის სახელი და ფრჩხილები, ფუნქციის სახელი მის გამოსაძახებლად. ამის შემდეგ უნდა დავწეროთ {} - ესეთი
// ფრჩხილები სადაც ჩავწერთ კოდს რომლიც გააქტიურდება ფუნქციის გამოძახებისას.

// ჯავასკრიპტის და ფაითონის ფუნქციები არცისე ბევრი რამით განსხვავდება პაითონში ჩვენ ვიყენებთ : ორწერტილს ფუნქციის დაწყებისთვის ხოლო
// ჯავასკრიპტში {} ამ ფრჩხილებს.



let name =prompt();