# 1)
# def summ(num1):
#     num1 = num1 * 5
#     print(num1)
# summ(5)

# 2)
# def summ(num1, num2):
#     print(num1 * num2)
# summ(12, 15)

# 3)
# def strg(st):
#     print(len(st))
# strg("ilia")

# 4)
# def lis(strg1, strg2, strg3):
#     print(len(strg1), len(strg2), len(strg3))
# lis("ilia", "andria", "luka")

# 5)შექმენით ფუნქცია, რომელიც იღებს string'ს და აბრუნებს True-ს თუ ის არის Palindrome (ანუ იგივენაირად იკითხება მარცნიდანაც და მარჯვნიდანაც მაგალითად: "wow") და სხვა შემთხვევაში False-ს.

# 6)შექმენით ფუნქცია, რომელიც პოულობს ყველაზე გრძელ string'ს string'ების სიაში.????????????????????????????????????????????????

# 7)შექმენით ფუნქცია, რომელიც იღებს რიცხვს და აბრუნებს მის factorial'ს

# 8),9,10,11,12,13,14,15,16,17,18,19,20,??????????????????????/