#დავალება 2
a = " sandroqucniashvili"
b = " გეგა ლომია"
c = " გიორგი მჭედლიშვილი"
d = " გიორგი ნინიაშვილი"
e = " დაჩი ძაგნიძე"
f = " ზუკა აბაშიძე"
g = " ზუკა გველესიანი"
h = " ლევანი მეტრეველი"
i = " ლიკა ბედოიძე"
j = " ლუკა დემეტრაშვილი"
k = " ლუკა პაპაშვილი"
l = " ლუკა ტატუაშვილი"
m = " ნიკა დოღონაძე"
n = " ნიკა ედიშერაშვილი"
o = " ნიკა ვანიშვილი"
p = " ნიკა მაჭარაშვილი"
q = " ნიკუშა ყუბანეიშვილი"
r = " სანდრო სულავა"
#ეს ისინი არიან ვინც ონლაინში იყო დანარჩენებს როცა იქნებიან ონლაინში გავუგზავნი მეგობრობას  :) 
print ( a + b + c + d + e + f + g + h + i + j + k + l + m + n + o + p + q + r )
#დავალება 3
#მე გოას აკადემაი მომწონს მისი თანამედროვე მიდგომით. აქ პროგრამინების გარდა არის შეხვედრები სახალისო
#შეჯიბრებები და ვარჯიში.ასევე გოას აკადემიაში მასწავლებლებიც ესე ვთქვათ თინეიჯერების ენაზე ლაპარაკობენ და იციან რითი 
#დაგვაინტერესონ და რა გვასწავლონ ჩვენი უკეთესი მომავლისთვის. მე ოველთვის მიზიდავდა პროგრამირება და გადავწყვიტე მისი 
#სწავლა გოას აკადემიაში დამეწყო რადგან ჩემი აზრით ეს საუკეთესო აკადემიაა პროგრამირების სასწავლებლად. ჩემი მიზანია 
#გამოვიდე კაი პროგრამისტი და დავიწყო მუშაობა უახლოეს დროში. გოას აკადემია კი დამეხმარება ამაში და როცა უკვე მექნება 
#შემოსავალი, უფრო დიდ მიზნებს მივაწვებიროგორიცაა: რაიმე ბიზნესი და საკუთარი კომპანია.